tap "clojure/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "mvndaemon/mvnd"
tap "wtfutil/wtfutil"
brew "python@3.10"
brew "asciinema"
brew "coreutils"
brew "asdf"
brew "autojump"
brew "bat"
brew "cowsay"
brew "exa"
brew "fd"
brew "findutils"
brew "gawk"
brew "git"
brew "gitui"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "guile"
brew "unbound"
brew "gnutls"
brew "grep"
brew "htop"
brew "hub"
brew "hugo"
brew "jq"
brew "librdkafka"
brew "kcat"
brew "ktlint"
brew "luajit", args: ["HEAD"]
brew "mongosh"
brew "navi"
brew "neovim"
brew "nghttp2"
brew "python@3.9"
brew "qpdf"
brew "ripgrep"
brew "stow"
brew "task"
brew "tasksh"
brew "timewarrior"
brew "tmate"
brew "tmux"
brew "up"
brew "vit"
brew "w3m"
brew "wtfutil"
brew "yq"
brew "zsh"
brew "clojure/tools/clojure"
brew "broot"
brew "git-delta"
brew "exercism"
cask "alacritty"
cask "android-commandlinetools"
cask "android-file-transfer"
cask "android-platform-tools"
cask "dash"
cask "dbeaver-community"
cask "docker"
cask "dozer"
cask "emacs"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "gpg-suite"
cask "hammerspoon"
cask "iina"
cask "iterm2"
cask "keepassxc"
cask "kite"
cask "kitty"
cask "meld"
cask "mongodb-compass"
cask "postman"
cask "raycast"
cask "skim"
cask "stretchly"
cask "syncthing"
cask "utterly"
cask "visual-studio-code"
