tap "clojure/tools"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "mvndaemon/mvnd"
tap "wtfutil/wtfutil"
brew "asciinema"
brew "autojump"
brew "bash" # the builtin version is horribly out of date
brew "bat"
brew "broot"
brew "clojure/tools/clojure"
brew "coreutils"
brew "cowsay"
brew "csvtk"
brew "diff-so-fancy"
brew "difftastic"
brew "exercism"
brew "fd"
brew "findutils"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "gitui"
brew "glow"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "grep"
brew "guile"
brew "htop" # Fancier and better top - process viewer
brew "hub" # Old github client - git compatible. superseded by gh
brew "hugo"
brew "jq" # json query tool
brew "kcat" # cat a kafka stream
brew "ktlint" # Kotlin code linter
brew "librdkafka"
brew "luajit", args: ["HEAD"]
brew "mise" # faster asdf. Multi tool multi version manager
brew "mongosh"
brew "neovim" # The better editor
brew "nghttp2"
brew "noahgorstein/tap/jqp"
brew "podman" # container runtime like docker
cask "docker-desktop"
brew "podman-compose"
brew "python@3.10"
brew "qpdf" # pdf munger
brew "ripgrep" # Blasing fast search
brew "secretive" # Securely store/manage ssh keys in MacOS secure enclave"
brew "stow" # symlink manager - useful for managing dotfiles
brew "task" # Taskwarrior - terminal task manager
brew "tasksh"
brew "timewarrior" # Terminal time tracker that works with taskwarrior
brew "tmate" # tmux but with web and ssh tunnels via tmate.io. Server self hostable.
brew "tmux" # Terminal multiplexer
brew "unbound"
brew "up"
brew "vit" # Visual Interface for Taskwarrior
brew "w3m"
brew "wtfutil"
brew "xplr" # Terminal File explorer
brew "xsv" # CSV toolkit
brew "yq" # like jq but for yaml,toml,xml,csv,json,properties,lua
brew "zsh" # Default zsh is horribly out of date
cask "alacritty" # Better Terminal
cask "android-commandlinetools"
cask "android-file-transfer" # Needed to transfer files from android phones
cask "android-platform-tools"
cask "dash" # Documentation Browser.
cask "dbeaver-community" # Database browser and query tool
cask "emacs-app"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "gpg-suite"
cask "hammerspoon" # Lua based MacOS Automation tool
cask "iina" # Video player
cask "iterm2" # Better Terminal
cask "keepassxc" # Password Manager
cask "kitty" # Better Terminal
cask "logseq" # Second brain - note taking tool
cask "meld" # GUI diff viewer
cask "podman-desktop"
cask "postman"
cask "raycast" # A spotlight replacement
cask "visual-studio-code" # Code editor from MS that's decent enough

tap "outrigdev/outrig"
brew "outrig" # Go development helper. Debug hools, variable watches, etc
brew "direnv"
cask "neovide-app"
brew "atuin"
brew "presenterm"
brew "watchman"
brew "jj"
